In [405]:
customer_ids = list(range(0,500))

In [406]:
transaction_ids = list(range(5000))

In [407]:
from faker import Faker

In [408]:
fake = Faker()

In [409]:
fake.name()

'Kevin Cruz'

In [410]:
customer_names = []
for i in range(len(customer_ids)):
    customer_names.append(fake.name())

In [411]:
join_dates = []
for i in range(len(customer_ids)):
    join_dates.append(fake.date())

In [412]:
customer_types_cat = ["corporate", "private"]

In [413]:
import random
customer_types = []
for i in range(len(customer_ids)):
    customer_types.append(random.choice(customer_types_cat))

In [414]:
import numpy as np
customer_balance = []
for i in range(len(customer_ids)):
    customer_balance.append(abs(np.random.normal()*10000))

In [415]:
customer_birthdate = []
for i in range(len(customer_ids)):
    customer_birthdate.append(fake.date())

In [416]:
gender_types_cat = ["male", "female"]

In [417]:
customer_gender = []
for i in range(len(customer_ids)):
    customer_gender.append(random.choice(gender_types_cat))

In [418]:
pep_types_cat = [True, False]

In [419]:
customer_pep = []
for i in range(len(customer_ids)):
    customer_pep.append(random.choice(pep_types_cat))

In [420]:
number_of_accounts = []
for i in range(len(customer_ids)):
    number_of_accounts.append(np.random.randint(1, 15))

In [421]:
matrix = np.array([customer_names, join_dates, customer_types, customer_balance, customer_birthdate, customer_gender, customer_pep, number_of_accounts])

In [422]:
matrix.shape

(8, 500)

In [423]:
for i in range(8):
    print(len(matrix[i]))

500
500
500
500
500
500
500
500

In [424]:
#matrix[0,:]

In [425]:
import pandas as pd
dataset = pd.DataFrame({
        'name':matrix[0,:],
        'join_date':matrix[1,:],
        'customer_type':matrix[2,:],
        'balance':matrix[3,:],
        "birthdate": matrix[4,:],
        "gender": matrix[5,:],
        "pep": matrix[6,:],
        "number_of_accounts": matrix[7,:]
    })

In [426]:
dataset.head()

,balance,birthdate,customer_type,gender,join_date,name,number_of_accounts,pep
0,5073.531904455142,1976-12-17,corporate,male,1996-02-13,Deborah Suarez,9,False
1,3723.845865576104,1978-09-25,corporate,female,1971-05-19,Angela Lee,3,True
2,17679.977215439445,2012-09-03,private,female,1986-10-24,Chad Green,6,True
3,4712.990764537736,1984-10-23,private,male,1992-09-26,Joshua Thompson,5,True
4,6224.162834962264,2017-07-20,corporate,male,1983-07-18,Lisa Chang,4,True

In [427]:
dataset.to_csv("kyc.csv", sep=',', encoding='utf-8',index=False)

In [428]:
trx_in_cust_id = []
for i in range(len(transaction_ids)):
    trx_in_cust_id.append(random.choice(customer_ids))

In [429]:
trx_dates = []
for i in range(len(transaction_ids)):
    trx_dates.append(fake.date())

In [430]:
trx_type_cat = ["ATM", "INTERNATIONAL", "DOMESTIC", "SWISH"]
trx_types = []
for i in range(len(transaction_ids)):
    trx_types.append(random.choice(trx_type_cat))

In [431]:
trx_amount = []
for i in range(len(transaction_ids)):
    trx_amount.append(abs(np.random.normal()*1000))

In [432]:
trx_bankid = []
for i in range(len(transaction_ids)):
    trx_bankid.append(np.random.randint(1, 10000000))

In [433]:
trx_out_cust_id = []
for i in range(len(transaction_ids)):
    counter = trx_in_cust_id[i]
    while counter == trx_in_cust_id[i]:
        counter = random.choice(customer_ids)
    trx_out_cust_id.append(counter)

In [434]:
trx_clearingnum = []
for i in range(len(transaction_ids)):
    trx_clearingnum.append(np.random.randint(1000, 9999))

In [435]:
trx_countries_cat = ["SWEDEN", "NORWAY", "UK", "LATVIA", "ESTONIA", "FINLAND", "RUSSIA", "ROMANIA"]

In [436]:
trx_countries = []
for i in range(len(transaction_ids)):
    trx_countries.append(random.choice(trx_countries_cat))

In [437]:
matrix2 = np.array([trx_in_cust_id, trx_dates, trx_types, trx_amount, trx_bankid, trx_out_cust_id, trx_clearingnum, trx_countries])

In [438]:
import pandas as pd
dataset2 = pd.DataFrame({
        'cust_id_in':matrix2[0,:],
        'trx_date':matrix2[1,:],
        'trx_type':matrix2[2,:],
        'trx_amount':matrix2[3,:],
        'trx_bankid':matrix2[4,:],
        "cust_id_out": matrix2[5,:],
        "trx_clearinnum": matrix2[6,:],
        "trx_country": matrix2[7,:]
    })

In [439]:
dataset2.head()

,cust_id_in,cust_id_out,trx_amount,trx_bankid,trx_clearinnum,trx_country,trx_date,trx_type
0,185,450,151.90202776566989,5909613,3635,RUSSIA,2005-12-18,SWISH
1,394,1,758.2610765692442,8164957,4740,ESTONIA,2015-07-06,INTERNATIONAL
2,377,300,641.9050367978414,9605219,7449,ROMANIA,2003-08-10,ATM
3,67,417,138.42001362149585,2678521,9198,LATVIA,1976-11-15,DOMESTIC
4,19,36,251.05080755264058,5091431,7973,SWEDEN,1994-04-14,SWISH

In [440]:
dataset2.to_csv("trx.csv", sep=',', encoding='utf-8', index=False)

In [441]:
reports_ids = list(range(100))

In [442]:
report_cust_id = []
for i in range(len(reports_ids)):
    report_cust_id.append(random.choice(customer_ids))

In [443]:
report_dates = []
for i in range(len(reports_ids)):
    report_dates.append(fake.date())

In [444]:
report_description = []
for i in range(len(reports_ids)):
    report_description.append("blablablabla")

In [445]:
matrix3 = np.array([reports_ids, report_cust_id, report_dates, report_description])

In [446]:
dataset3 = pd.DataFrame({
        'report_id':matrix3[0,:],
        'cust_id':matrix3[1,:],
        'report_date':matrix3[2,:],
        'description':matrix3[3,:]
    })

In [447]:
dataset3.head()

  cust_id   description report_date report_id
0     440  blablablabla  2006-10-18         0
1      42  blablablabla  1993-04-27         1
2     207  blablablabla  2001-03-16         2
3     405  blablablabla  2010-08-16         3
4     371  blablablabla  2011-07-24         4

In [448]:
dataset3.to_csv("police_reports.csv", sep=',', encoding='utf-8', index=False)

In [449]:
web_ids = list(range(5000))

In [450]:
web_cust_id = []
for i in range(len(web_ids)):
    web_cust_id.append(random.choice(customer_ids))

In [451]:
web_seconds = []
for i in range(len(web_ids)):
    web_seconds.append(np.random.randint(15, 1000))

In [452]:
ips = [fake.ipv4() for i in range(50)]
#fake.ipv4()

In [453]:
web_address = []
for i in range(len(web_ids)):
    web_address.append(random.choice(ips))

In [454]:
web_actions_cat = ["browse", "transactions", "update_profile", "request_loan", "create_account"]

In [455]:
web_actions = []
for i in range(len(web_ids)):
    web_actions.append(random.choice(web_actions_cat))

In [456]:
matrix4 = np.array([web_ids, web_cust_id, web_seconds, web_address, web_actions])

In [457]:
dataset4 = pd.DataFrame({
        'web_id':matrix4[0,:],
        'cust_id':matrix4[1,:],
        'time_spent_seconds':matrix4[2,:],
        'address':matrix4[3,:],
        "action": matrix4[4,:]
    })

In [458]:
dataset4.head()

           action          address cust_id time_spent_seconds web_id
0          browse    10.208.131.79     279                772      0
1          browse  192.170.227.152     150                500      1
2  update_profile   192.159.46.227     140                145      2
3  update_profile   198.243.53.201     491                886      3
4    transactions    10.208.131.79     307                899      4

In [459]:
dataset4.to_csv("web_logs.csv", sep=',', encoding='utf-8', index=False)

In [460]:
alert_ids = list(range(300))

In [461]:
alert_trx_id = []
for i in range(len(alert_ids)):
    alert_trx_id.append(random.choice(transaction_ids))

In [462]:
alert_date = []
for i in range(len(alert_ids)):
    alert_date.append(fake.date())

In [463]:
alert_type_cat = ["TERRORISM", "HIGH_INT_PAYMENT", "SMURFING", "REPEATED_SWISH"]

In [464]:
alert_types = []
for i in range(len(alert_ids)):
    alert_types.append(random.choice(alert_type_cat))

In [465]:
alert_score = []
for i in range(len(alert_ids)):
    alert_score.append(abs(np.random.normal()))

In [466]:
alert_rule_name_cat = ["TOOK_OVER_4_LOANS_IN_ONE_DAY", "TOOK_LOANS_FROM_MORE_THAN_1_BANK_IN_ONE_DAY", "INT_PAYMENT_OVER_5K", "SMURFING_OVER_5_ACCOUNTS", "SMURFING_OVER_10_ACCOUNTS", "REPEATED_SWISH", "MANY_SWISH_ACCOUNTS"]

In [467]:
rule_names = []
for i in range(len(alert_ids)):
    rule_names.append(random.choice(alert_rule_name_cat))

In [468]:
alert_description = []
for i in range(len(alert_ids)):
    alert_description.append("blablablablablabla")

In [469]:
matrix5 = np.array([alert_ids, alert_trx_id, alert_date, alert_types, alert_score, rule_names, alert_description])

In [470]:
dataset5 = pd.DataFrame({
        'alert_id':matrix5[0,:],
        'trx_id':matrix5[1,:],
        'alert_date':matrix5[2,:],
        'alert_type':matrix5[3,:],
        "alert_score": matrix5[4,:],
        "rule_name": matrix5[5,:],
        "alert_desc": matrix5[6,:],  
    })

In [471]:
dataset5.head()

,alert_date,alert_desc,alert_id,alert_score,alert_type,rule_name,trx_id
0,1989-08-05,blablablablablabla,0,0.36532333120607113,REPEATED_SWISH,SMURFING_OVER_10_ACCOUNTS,1125
1,1975-07-16,blablablablablabla,1,1.2380753312749344,TERRORISM,SMURFING_OVER_10_ACCOUNTS,2777
2,1983-12-18,blablablablablabla,2,1.6973307463119836,SMURFING,MANY_SWISH_ACCOUNTS,303
3,1996-01-02,blablablablablabla,3,2.012654805760939,REPEATED_SWISH,TOOK_OVER_4_LOANS_IN_ONE_DAY,211
4,1989-05-05,blablablablablabla,4,0.04267300582768137,REPEATED_SWISH,TOOK_LOANS_FROM_MORE_THAN_1_BANK_IN_ONE_DAY,2909

In [472]:
dataset5.to_csv("alerts.csv", sep=',', encoding='utf-8', index=False)

In [473]:
corporate_ids = list(range(100))

In [474]:
indudstry_sector_cat = ["AGRICULTURE", "IT", "CONSTRUCTION", "ENERGY", "AEROSPACE", "ENTERTAINMENT"]

In [475]:
industry_sectors = []
for i in range(len(corporate_ids)):
    industry_sectors.append(random.choice(indudstry_sector_cat))

In [476]:
externa_kostnader = []
for i in range(len(corporate_ids)):
    externa_kostnader.append(abs(np.random.normal()*10000))

In [477]:
rente_kostnader = []
for i in range(len(corporate_ids)):
    rente_kostnader.append(abs(np.random.normal()*1000))

In [478]:
netomsettning = []
for i in range(len(corporate_ids)):
    netomsettning.append(abs(np.random.normal()*100000))

In [479]:
netomsettning_3year = []
for i in range(len(corporate_ids)):
    netomsettning_3year.append(abs(np.random.normal()*10000))

In [480]:
netomsettning_2year = []
for i in range(len(corporate_ids)):
    netomsettning_2year.append(abs(np.random.normal()*1000))

In [481]:
netomsettning_1year = []
for i in range(len(corporate_ids)):
    netomsettning_1year.append(abs(np.random.normal()*100))

In [482]:
matrix6 = np.array([corporate_ids, industry_sectors, externa_kostnader, netomsettning, netomsettning_3year, netomsettning_2year, netomsettning_1year])

In [483]:
dataset6 = pd.DataFrame({
        'corporate_id':matrix6[0,:],
        'industry_sector':matrix6[1,:],
        'externa_kostnader':matrix6[2,:],
        'netomsettning':matrix6[3,:],
        "netomsettning_3year": matrix6[4,:],
        "netomsettning_2year": matrix6[5,:],
        "netomsettning_1year": matrix6[6,:],  
    })

In [484]:
dataset6.head()

,corporate_id,externa_kostnader,industry_sector,netomsettning,netomsettning_1year,netomsettning_2year,netomsettning_3year
0,0,8984.812470216919,AGRICULTURE,376.6270719531958,7.658985465549133,1051.5445156911144,5737.001849731348
1,1,1728.2574812642915,CONSTRUCTION,97997.94199212627,71.8541223061984,872.9344074477484,3321.46161890502
2,2,6321.91016936913,AEROSPACE,58006.93502988875,60.88998219752184,346.87019011433733,15967.146762183433
3,3,15607.60408688306,AEROSPACE,145510.14811566827,255.95948058250997,719.9988146716439,17819.46581147422
4,4,18291.264600343216,AGRICULTURE,33542.7847862885,29.381549478785008,701.8299792843386,1911.5965792824215

In [485]:
dataset6.to_csv("hipo.csv", sep=',', encoding='utf-8', index=False)